oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2026-09-05     RT-Thread    three-channel ADC USB microphone
 */

#include <rthw.h>
#include <rtthread.h>

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "board.h"
#include "fsl_clock.h"
#include "fsl_ctimer.h"
#include "fsl_edma.h"
#include "fsl_inputmux.h"
#include "fsl_inputmux_connections.h"
#include "fsl_lpadc.h"
#include "fsl_opamp.h"
#include "fsl_port.h"
#include "usbd_audio.h"
#include "usbd_core.h"

#if defined(RT_CHERRYUSB_DEVICE_TEMPLATE_NONE) && defined(RT_CHERRYUSB_DEVICE_AUDIO)

#define USBD_VID           0x2200
#define USBD_PID           0x0009
#define USBD_MAX_POWER     100
#define USBD_LANGID_STRING 1033

#ifdef CONFIG_USB_HS
/* HS: bInterval is log2(microframes of 125us). 2^3 = 8 microframes = 1 ms,
 * matching the 16 samples per 96-byte packet. 0x04 would mean 2 ms per
 * 1 ms of audio. */
#define EP_INTERVAL 0x03
#else
#define EP_INTERVAL 0x01
#endif

#define USB_ADC_MIC_SAMPLE_RATE      16000U
#define USB_ADC_MIC_CHANNELS         3U
#define USB_ADC_MIC_BYTES_PER_SAMPLE 2U
#define USB_ADC_MIC_BITS_PER_SAMPLE  16U
#define USB_ADC_MIC_SAMPLES_PER_MS   (USB_ADC_MIC_SAMPLE_RATE / 1000U)
#define USB_ADC_MIC_PACKET_BYTES     (USB_ADC_MIC_SAMPLES_PER_MS * USB_ADC_MIC_CHANNELS * USB_ADC_MIC_BYTES_PER_SAMPLE)
#define USB_ADC_MIC_AUDIO_SLOT_BYTES (USB_ADC_MIC_CHANNELS * USB_ADC_MIC_BYTES_PER_SAMPLE)
#define USB_ADC_MIC_EP_MAX_PACKET_BYTES (USB_ADC_MIC_PACKET_BYTES + USB_ADC_MIC_AUDIO_SLOT_BYTES)
#define USB_ADC_MIC_CTIMER_MATCH_RATE (USB_ADC_MIC_SAMPLE_RATE)
#define USB_ADC_MIC_TX_THREAD_STACK_SIZE 2048U
#define USB_ADC_MIC_TX_THREAD_PRIORITY   8U
#define USB_ADC_MIC_TX_THREAD_TICK       10U

#ifndef USB_ADC_MIC_USE_TEST_TONE
#define USB_ADC_MIC_USE_TEST_TONE 1
#endif

#if USB_ADC_MIC_USE_TEST_TONE
#define USB_ADC_MIC_TEST_TONE_HZ         997U
/* sine_32pt[] below is a literal table with exactly 32 entries, so its dimension
 * must stay 32, and PHASE_SHIFT must stay 32 - log2(32) = 27: index is
 * (phase >> PHASE_SHIFT) out of a 32-bit phase, so a larger shift would only
 * ever address the table's upper indices 0..15.
 *
 * Deriving both from a "TABLE_BITS" shift used to work only by accident: at
 * TABLE_BITS=4 the array became 16 elements while still holding 32
 * initializers (a C constraint violation) and the compiler kept just the
 * positive half-cycle, which is why TABLE_BITS=4 produced a rectified
 * unipolar pulse instead of a sine wave. */
#define USB_ADC_MIC_TEST_TONE_TABLE_SIZE  32U
#define USB_ADC_MIC_TEST_TONE_PHASE_SHIFT 27U
#define USB_ADC_MIC_TEST_TONE_PHASE_STEP \
    ((uint32_t)(((uint64_t)USB_ADC_MIC_TEST_TONE_HZ << 32) / USB_ADC_MIC_SAMPLE_RATE))
#endif

#define USB_ADC_MIC_DMA_BLOCKS 8U
#define USB_ADC_MIC_PCM_BLOCKS 8U

#define AUDIO_IN_EP       0x81
#define AUDIO_IN_CLOCK_ID 0x01
#define AUDIO_IN_FU_ID    0x03

#define BMCONTROL       (AUDIO_V2_CONTROL_MUTE | AUDIO_V2_CONTROL_VOLUME)
#define INPUT_CTRL      DBVAL(BMCONTROL), DBVAL(BMCONTROL), DBVAL(BMCONTROL), DBVAL(BMCONTROL)
#define INPUT_CH_ENABLE 0x00000007

#define USB_ADC_MIC_ADC_CMD_ID     1U
#define USB_ADC_MIC_ADC_TRIGGER_ID 0U

#define USB_ADC_MIC_DMA_CHANNEL_ADC0_A 0U
#define USB_ADC_MIC_DMA_CHANNEL_ADC1_A 3U
#define USB_ADC_MIC_DMA_CHANNEL_ADC1_B 4U

#ifndef USB_ADC_MIC_USE_OPAMP
#define USB_ADC_MIC_USE_OPAMP 0
#endif

/* LPADC channel numbers for ADC0_A2 + ADC1_A0 + ADC1_B0. */
#ifndef USB_ADC_MIC_ADC0_A_CHANNEL
#define USB_ADC_MIC_ADC0_A_CHANNEL 2U
#endif

#ifndef USB_ADC_MIC_ADC1_A_CHANNEL
#define USB_ADC_MIC_ADC1_A_CHANNEL 0U
#endif

#ifndef USB_ADC_MIC_ADC1_B_CHANNEL
#define USB_ADC_MIC_ADC1_B_CHANNEL 0U
#endif

#ifndef USB_ADC_MIC_OPAMP_GAIN
#define USB_ADC_MIC_OPAMP_GAIN kOPAMP_PosGainNonInvert1X
#endif

#define USB_CONFIG_SIZE (9 +                                                                  \
                         AUDIO_V2_AC_DESCRIPTOR_LEN +                                         \
                         AUDIO_V2_SIZEOF_AC_CLOCK_SOURCE_DESC +                               \
                         AUDIO_V2_SIZEOF_AC_INPUT_TERMINAL_DESC +                             \
                         AUDIO_V2_SIZEOF_AC_FEATURE_UNIT_DESC(USB_ADC_MIC_CHANNELS) +          \
                         AUDIO_V2_SIZEOF_AC_OUTPUT_TERMINAL_DESC +                            \
                         AUDIO_V2_AS_DESCRIPTOR_LEN)

#define AUDIO_AC_SIZ (AUDIO_V2_SIZEOF_AC_HEADER_DESC +                                      \
                      AUDIO_V2_SIZEOF_AC_CLOCK_SOURCE_DESC +                                \
                      AUDIO_V2_SIZEOF_AC_INPUT_TERMINAL_DESC +                              \
                      AUDIO_V2_SIZEOF_AC_FEATURE_UNIT_DESC(USB_ADC_MIC_CHANNELS) +           \
                      AUDIO_V2_SIZEOF_AC_OUTPUT_TERMINAL_DESC)

static const uint8_t device_descriptor[] =
{
    USB_DEVICE_DESCRIPTOR_INIT(USB_2_0, 0x00, 0x00, 0x00, USBD_VID, USBD_PID, 0x0001, 0x01)
};

static const uint8_t config_descriptor[] =
{
    USB_CONFIG_DESCRIPTOR_INIT(USB_CONFIG_SIZE, 0x02, 0x01, USB_CONFIG_BUS_POWERED, USBD_MAX_POWER),
    AUDIO_V2_AC_DESCRIPTOR_INIT(0x00, 0x02, AUDIO_AC_SIZ, AUDIO_CATEGORY_MICROPHONE, 0x00, 0x00),
    AUDIO_V2_AC_CLOCK_SOURCE_DESCRIPTOR_INIT(AUDIO_IN_CLOCK_ID, 0x01, 0x01),
    AUDIO_V2_AC_INPUT_TERMINAL_DESCRIPTOR_INIT(0x02, AUDIO_INTERM_MIC, AUDIO_IN_CLOCK_ID,
                                               USB_ADC_MIC_CHANNELS, INPUT_CH_ENABLE, 0x0000),
    AUDIO_V2_AC_FEATURE_UNIT_DESCRIPTOR_INIT(AUDIO_IN_FU_ID, 0x02, INPUT_CTRL),
    AUDIO_V2_AC_OUTPUT_TERMINAL_DESCRIPTOR_INIT(0x04, AUDIO_TERMINAL_STREAMING, AUDIO_IN_FU_ID,
                                                AUDIO_IN_CLOCK_ID, 0x0000),
    AUDIO_V2_AS_DESCRIPTOR_INIT(0x01, 0x04, USB_ADC_MIC_CHANNELS, INPUT_CH_ENABLE,
                                USB_ADC_MIC_BYTES_PER_SAMPLE, USB_ADC_MIC_BITS_PER_SAMPLE,
                                AUDIO_IN_EP, 0x05, USB_ADC_MIC_EP_MAX_PACKET_BYTES, EP_INTERVAL)
};

static const uint8_t device_quality_descriptor[] =
{
    0x0a,
    USB_DESCRIPTOR_TYPE_DEVICE_QUALIFIER,
    0x00,
    0x02,
    0x00,
    0x00,
    0x00,
    0x40,
    0x00,
    0x00,
};

