oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
static const char *string_descriptors[] =
{
    (const char[]){ 0x09, 0x04 },
    "RT-Thread",
    "FRDM-MCXN947 ADC MIC",
    "2026090504",
};

static const uint8_t mic_default_sampling_freq_table[] =
{
    AUDIO_SAMPLE_FREQ_NUM(1),
    AUDIO_SAMPLE_FREQ_4B(USB_ADC_MIC_SAMPLE_RATE),
    AUDIO_SAMPLE_FREQ_4B(USB_ADC_MIC_SAMPLE_RATE),
    AUDIO_SAMPLE_FREQ_4B(0x00),
};

static volatile bool s_hw_inited;
static volatile bool s_streaming;
static volatile bool s_ep_tx_busy;
static volatile bool s_usb_tx_worker_inited;
static uint8_t s_usb_busid;
static volatile uint32_t s_mic_sample_rate = USB_ADC_MIC_SAMPLE_RATE;

static uint8_t s_pcm_ring[USB_ADC_MIC_PCM_BLOCKS][USB_ADC_MIC_PACKET_BYTES];
static volatile uint8_t s_pcm_read;
static volatile uint8_t s_pcm_write;
static volatile uint8_t s_pcm_count;
static volatile uint32_t s_pcm_overruns;
#if !USB_ADC_MIC_USE_TEST_TONE
static volatile uint32_t s_usb_underruns;
#endif
static volatile bool s_usb_mute_state[USB_ADC_MIC_CHANNELS + 1U];
static volatile int s_usb_volume_db[USB_ADC_MIC_CHANNELS + 1U];
#if USB_ADC_MIC_USE_TEST_TONE
static uint32_t s_test_tone_phase;
#endif

static USB_NOCACHE_RAM_SECTION USB_MEM_ALIGNX uint8_t s_usb_tx_buffer[USB_ADC_MIC_PACKET_BYTES];
static struct rt_semaphore s_usb_tx_sem;
static struct rt_thread s_usb_tx_thread;
rt_align(RT_ALIGN_SIZE) static rt_uint8_t s_usb_tx_thread_stack[USB_ADC_MIC_TX_THREAD_STACK_SIZE];

AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc0_a_samples[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc1_a_samples[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS], 4U);
AT_NONCACHEABLE_SECTION_ALIGN(static volatile uint32_t s_adc1_b_samples[USB_ADC_MIC_DMA_BLOCKS][USB_ADC_MIC_SAMPLES_PER_MS], 4U);

EDMA_ALLOCATE_TCD(s_adc0_a_tcd, USB_ADC_MIC_DMA_BLOCKS);
EDMA_ALLOCATE_TCD(s_adc1_a_tcd, USB_ADC_MIC_DMA_BLOCKS);
EDMA_ALLOCATE_TCD(s_adc1_b_tcd, USB_ADC_MIC_DMA_BLOCKS);

static edma_handle_t s_dma_handle[USB_ADC_MIC_CHANNELS];
static edma_transfer_config_t s_dma_transfer[USB_ADC_MIC_CHANNELS][USB_ADC_MIC_DMA_BLOCKS];
static volatile uint32_t s_dma_done_count[USB_ADC_MIC_CHANNELS];
static volatile uint32_t s_mixed_count;

static const volatile uint32_t *const s_adc_sample_src[USB_ADC_MIC_CHANNELS] =
{
    &s_adc0_a_samples[0][0],
    &s_adc1_a_samples[0][0],
    &s_adc1_b_samples[0][0],
};

static const uint8_t *device_descriptor_callback(uint8_t speed)
{
    (void)speed;

    return device_descriptor;
}

static const uint8_t *config_descriptor_callback(uint8_t speed)
{
    (void)speed;

    return config_descriptor;
}

static const uint8_t *device_quality_descriptor_callback(uint8_t speed)
{
    (void)speed;

    return device_quality_descriptor;
}

static const char *string_descriptor_callback(uint8_t speed, uint8_t index)
{
    (void)speed;

    if (index >= (sizeof(string_descriptors) / sizeof(string_descriptors[0])))
    {
        return RT_NULL;
    }

    return string_descriptors[index];
}

static const struct usb_descriptor audio_v2_descriptor =
{
    .device_descriptor_callback = device_descriptor_callback,
    .config_descriptor_callback = config_descriptor_callback,
    .device_quality_descriptor_callback = device_quality_descriptor_callback,
    .string_descriptor_callback = string_descriptor_callback
};

static void usb_adc_mic_try_send(uint8_t busid);
static void usb_adc_mic_kick_tx(void);
static void usb_adc_mic_stop_stream(void);

static void usb_adc_mic_tx_thread_entry(void *parameter)
{
    (void)parameter;

    while (1)
    {
        if (rt_sem_take(&s_usb_tx_sem, RT_WAITING_FOREVER) == RT_EOK)
        {
            usb_adc_mic_try_send(s_usb_busid);
        }
    }
}

static bool usb_adc_mic_tx_worker_init(uint8_t busid)
{
    rt_err_t err;

    s_usb_busid = busid;
    if (s_usb_tx_worker_inited)
    {
        return true;
    }

    err = rt_sem_init(&s_usb_tx_sem, "uacm_tx", 0, RT_IPC_FLAG_FIFO);
    if (err != RT_EOK)
    {
        USB_LOG_ERR("ADC MIC TX sem init failed: %d\r\n", (int)err);
        return false;
    }

    err = rt_thread_init(&s_usb_tx_thread,
                         "uacm_tx",
                         usb_adc_mic_tx_thread_entry,
                         RT_NULL,
                         s_usb_tx_thread_stack,
                         sizeof(s_usb_tx_thread_stack),
                         USB_ADC_MIC_TX_THREAD_PRIORITY,
                         USB_ADC_MIC_TX_THREAD_TICK);
    if (err != RT_EOK)
    {
        USB_LOG_ERR("ADC MIC TX thread init failed: %d\r\n", (int)err);
        return false;
    }

    err = rt_thread_startup(&s_usb_tx_thread);
    if (err != RT_EOK)
    {
        USB_LOG_ERR("ADC MIC TX thread startup failed: %d\r\n", (int)err);
        return false;
    }

    s_usb_tx_worker_inited = true;
    return true;
}

static void usb_adc_mic_kick_tx(void)
{
    if (s_usb_tx_worker_inited)
    {
        (void)rt_sem_release(&s_usb_tx_sem);
    }
}

static void usb_adc_mic_ring_reset(void)
{
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    s_pcm_read = 0U;
    s_pcm_write = 0U;
    s_pcm_count = 0U;
    s_dma_done_count[0] = 0U;
    s_dma_done_count[1] = 0U;
    s_dma_done_count[2] = 0U;
    s_mixed_count = 0U;
    rt_hw_interrupt_enable(level);
}

static void usb_adc_mic_ring_push(const uint8_t *data)
{
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    if (s_pcm_count >= USB_ADC_MIC_PCM_BLOCKS)
    {
        s_pcm_read = (uint8_t)((s_pcm_read + 1U) % USB_ADC_MIC_PCM_BLOCKS);
        s_pcm_count--;
        s_pcm_overruns++;
    }

    memcpy(s_pcm_ring[s_pcm_write], data, USB_ADC_MIC_PACKET_BYTES);
    s_pcm_write = (uint8_t)((s_pcm_write + 1U) % USB_ADC_MIC_PCM_BLOCKS);
    s_pcm_count++;
    rt_hw_interrupt_enable(level);
}

#if !USB_ADC_MIC_USE_TEST_TONE
static bool usb_adc_mic_ring_pop(uint8_t *data)
{
    bool has_data = false;
    rt_base_t level;

    level = rt_hw_interrupt_disable();
    if (s_pcm_count > 0U)
    {
        memcpy(data, s_pcm_ring[s_pcm_read], USB_ADC_MIC_PACKET_BYTES);
        s_pcm_read = (uint8_t)((s_pcm_read + 1U) % USB_ADC_MIC_PCM_BLOCKS);
        s_pcm_count--;
        has_data = true;
    }
    rt_hw_interrupt_enable(level);

    return has_data;
}
#endif

static int16_t usb_adc_mic_adc_to_pcm(uint32_t raw)
{
    uint16_t sample;

    sample = (uint16_t)(raw & ADC_RESFIFO_D_MASK);

