oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
    LPADC_Init(base, &config);

#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE
    LPADC_DoOffsetCalibration(base, kLPADC_OffsetCalibration16bitMode);
#else
    LPADC_DoOffsetCalibration(base);
#endif
    LPADC_DoAutoCalibration(base);
}

static void usb_adc_mic_config_adc0(void)
{
    lpadc_conv_command_config_t command;
    lpadc_conv_trigger_config_t trigger;

    LPADC_GetDefaultConvCommandConfig(&command);
    command.sampleChannelMode = kLPADC_SampleChannelSingleEndSideA;
    command.channelNumber = USB_ADC_MIC_ADC0_A_CHANNEL;
#if defined(FSL_FEATURE_LPADC_HAS_CMDL_MODE) && FSL_FEATURE_LPADC_HAS_CMDL_MODE
    command.conversionResolutionMode = kLPADC_ConversionResolutionHigh;
#endif
#if defined(FSL_FEATURE_LPADC_HAS_CMDL_ALTBEN) && FSL_FEATURE_LPADC_HAS_CMDL_ALTBEN
    command.enableChannelB = false;
#endif
    command.hardwareAverageMode = kLPADC_HardwareAverageCount1;
    command.sampleTimeMode = kLPADC_SampleTimeADCK35;
    LPADC_SetConvCommandConfig(ADC0, USB_ADC_MIC_ADC_CMD_ID, &command);

    memset(&trigger, 0, sizeof(trigger));
    trigger.targetCommandId = USB_ADC_MIC_ADC_CMD_ID;
#if (defined(FSL_FEATURE_LPADC_FIFO_COUNT) && (FSL_FEATURE_LPADC_FIFO_COUNT == 2))
    trigger.channelAFIFOSelect = 0U;
#endif
    trigger.enableHardwareTrigger = true;
    LPADC_SetConvTriggerConfig(ADC0, USB_ADC_MIC_ADC_TRIGGER_ID, &trigger);

    LPADC_EnableFIFO0WatermarkDMA(ADC0, true);
    LPADC_EnableFIFO1WatermarkDMA(ADC0, false);
}

static void usb_adc_mic_config_adc1(void)
{
    lpadc_conv_command_config_t command;
    lpadc_conv_trigger_config_t trigger;

    LPADC_GetDefaultConvCommandConfig(&command);
    command.sampleChannelMode = kLPADC_SampleChannelDualSingleEndBothSide;
    command.channelNumber = USB_ADC_MIC_ADC1_A_CHANNEL;
#if defined(FSL_FEATURE_LPADC_HAS_CMDL_ALTB_ADCH) && FSL_FEATURE_LPADC_HAS_CMDL_ALTB_ADCH
    command.channelBNumber = USB_ADC_MIC_ADC1_B_CHANNEL;
#endif
#if defined(FSL_FEATURE_LPADC_HAS_CMDL_MODE) && FSL_FEATURE_LPADC_HAS_CMDL_MODE
    command.conversionResolutionMode = kLPADC_ConversionResolutionHigh;
#endif
#if defined(FSL_FEATURE_LPADC_HAS_CMDL_ALTBEN) && FSL_FEATURE_LPADC_HAS_CMDL_ALTBEN
    command.enableChannelB = true;
#endif
    command.hardwareAverageMode = kLPADC_HardwareAverageCount1;
    command.sampleTimeMode = kLPADC_SampleTimeADCK35;
    LPADC_SetConvCommandConfig(ADC1, USB_ADC_MIC_ADC_CMD_ID, &command);

    memset(&trigger, 0, sizeof(trigger));
    trigger.targetCommandId = USB_ADC_MIC_ADC_CMD_ID;
#if (defined(FSL_FEATURE_LPADC_FIFO_COUNT) && (FSL_FEATURE_LPADC_FIFO_COUNT == 2))
    trigger.channelAFIFOSelect = 0U;
    trigger.channelBFIFOSelect = 1U;
#endif
    trigger.enableHardwareTrigger = true;
    LPADC_SetConvTriggerConfig(ADC1, USB_ADC_MIC_ADC_TRIGGER_ID, &trigger);

    LPADC_EnableFIFO0WatermarkDMA(ADC1, true);
    LPADC_EnableFIFO1WatermarkDMA(ADC1, true);
}

static void usb_adc_mic_config_ctimer(void)
{
    ctimer_config_t timer_config;
    ctimer_match_config_t match_config;
    uint32_t timer_clk;
    uint32_t match_value;

    CTIMER_GetDefaultConfig(&timer_config);
    CTIMER_Init(CTIMER0, &timer_config);

    timer_clk = CLOCK_GetCTimerClkFreq(0U);
    match_value = (timer_clk / USB_ADC_MIC_CTIMER_MATCH_RATE) - 1U;

    memset(&match_config, 0, sizeof(match_config));
    match_config.enableCounterReset = true;
    match_config.enableCounterStop = false;
    match_config.matchValue = match_value;
    match_config.outControl = kCTIMER_Output_Toggle;
    match_config.outPinInitState = false;
    match_config.enableInterrupt = false;
    CTIMER_SetupMatch(CTIMER0, kCTIMER_Match_3, &match_config);
}

static void usb_adc_mic_hw_init(void)
{
    if (s_hw_inited)
    {
        return;
    }

    CLOCK_EnableClock(kCLOCK_InputMux);
    CLOCK_EnableClock(kCLOCK_Dma0);
    CLOCK_AttachClk(kFRO12M_to_ADC0);
    CLOCK_SetClkDiv(kCLOCK_DivAdc0Clk, 1U);
    CLOCK_AttachClk(kFRO12M_to_ADC1);
    CLOCK_SetClkDiv(kCLOCK_DivAdc1Clk, 1U);
    CLOCK_AttachClk(kFRO12M_to_CTIMER0);
    CLOCK_SetClkDiv(kCLOCK_DivCtimer0Clk, 1U);

    INPUTMUX_Init(INPUTMUX);
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_Ctimer0M3ToAdc0Trigger);
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_Ctimer0M3ToAdc1Trigger);
    INPUTMUX_EnableSignal(INPUTMUX, kINPUTMUX_Adc0FifoARequestToDma0Ch21Ena, true);
    INPUTMUX_EnableSignal(INPUTMUX, kINPUTMUX_Adc1FifoARequestToDma0Ch23Ena, true);
    INPUTMUX_EnableSignal(INPUTMUX, kINPUTMUX_Adc1FifoBRequestoDma0Ch24Ena, true);

#if USB_ADC_MIC_USE_OPAMP
    usb_adc_mic_init_opamp(OPAMP0);
    usb_adc_mic_init_opamp(OPAMP1);
    usb_adc_mic_init_opamp(OPAMP2);
#endif

    usb_adc_mic_config_adc_pins();
    usb_adc_mic_init_lpadc(ADC0);
    usb_adc_mic_init_lpadc(ADC1);
    usb_adc_mic_config_adc0();
    usb_adc_mic_config_adc1();
    usb_adc_mic_config_ctimer();

    usb_adc_mic_prepare_dma_ring(&s_dma_handle[0], &s_dma_transfer[0][0], s_adc0_a_tcd,
                                 USB_ADC_MIC_DMA_CHANNEL_ADC0_A, kDma0RequestMuxAdc0FifoARequest,
                                 &ADC0->RESFIFO[0], s_adc0_a_samples, (void *)(uintptr_t)0U);
    usb_adc_mic_prepare_dma_ring(&s_dma_handle[1], &s_dma_transfer[1][0], s_adc1_a_tcd,
                                 USB_ADC_MIC_DMA_CHANNEL_ADC1_A, kDma0RequestMuxAdc1FifoARequest,
                                 &ADC1->RESFIFO[0], s_adc1_a_samples, (void *)(uintptr_t)1U);
    usb_adc_mic_prepare_dma_ring(&s_dma_handle[2], &s_dma_transfer[2][0], s_adc1_b_tcd,
                                 USB_ADC_MIC_DMA_CHANNEL_ADC1_B, kDma0RequestMuxAdc1FifoBRequest,
                                 &ADC1->RESFIFO[1], s_adc1_b_samples, (void *)(uintptr_t)2U);

    s_hw_inited = true;
}

static bool usb_adc_mic_start_stream(void)
{
    if (!s_hw_inited)
    {
        usb_adc_mic_hw_init();
    }

    usb_adc_mic_stop_stream();
    usb_adc_mic_ring_reset();
    memset(s_usb_tx_buffer, 0, sizeof(s_usb_tx_buffer));
#if USB_ADC_MIC_USE_TEST_TONE
    s_test_tone_phase = 0U;
#endif

    LPADC_DoResetFIFO0(ADC0);
    LPADC_DoResetFIFO0(ADC1);
    LPADC_DoResetFIFO1(ADC1);

/* In test tone mode the samples come from sine_32pt[] straight into
 * s_usb_tx_buffer, so nothing reads the ADC DMA destination buffers. The three
 * EDMA_SubmitLoopTransfer() calls must not be allowed to veto streaming: each
 * was one failure that killed the whole stream.
 *
 * CTIMER is intentionally left running. No LPADC interrupt is enabled anywhere
 * in this file, so the undrained ADC FIFOs just overflow silently, and leaving
 * it running also means usb_adc_mic_stop_stream() needs no changes. */
#if !USB_ADC_MIC_USE_TEST_TONE
    if (!usb_adc_mic_start_dma_ring(&s_dma_handle[0], &s_dma_transfer[0][0]))
    {
        return false;
    }
    if (!usb_adc_mic_start_dma_ring(&s_dma_handle[1], &s_dma_transfer[1][0]))
    {
        EDMA_AbortTransfer(&s_dma_handle[0]);
        return false;
    }
    if (!usb_adc_mic_start_dma_ring(&s_dma_handle[2], &s_dma_transfer[2][0]))
    {
        EDMA_AbortTransfer(&s_dma_handle[0]);
        EDMA_AbortTransfer(&s_dma_handle[1]);
        return false;
    }
#endif

    s_streaming = true;
    s_ep_tx_busy = false;
    CTIMER_Reset(CTIMER0);
    CTIMER_StartTimer(CTIMER0);

