oxlm/rt-thread/bsp/nxp/mcx/mcxn/frdm-mcxn947/applications/usb_adc_mic.c
    return true;
}

static void usb_adc_mic_stop_stream(void)
{
    if (!s_hw_inited)
    {
        return;
    }

    s_streaming = false;
    CTIMER_StopTimer(CTIMER0);
    EDMA_AbortTransfer(&s_dma_handle[0]);
    EDMA_AbortTransfer(&s_dma_handle[1]);
    EDMA_AbortTransfer(&s_dma_handle[2]);
    LPADC_DoResetFIFO0(ADC0);
    LPADC_DoResetFIFO0(ADC1);
    LPADC_DoResetFIFO1(ADC1);

    s_ep_tx_busy = false;
}

#if USB_ADC_MIC_USE_TEST_TONE
static const int16_t sine_32pt[USB_ADC_MIC_TEST_TONE_TABLE_SIZE] =
{
    0, 3902, 7654, 11111,
    14142, 16629, 18478, 19616,
    20000, 19616, 18478, 16629,
    14142, 11111, 7654, 3902,
    0, -3902, -7654, -11111,
    -14142, -16629, -18478, -19616,
    -20000, -19616, -18478, -16629,
    -14142, -11111, -7654, -3902
};

static int16_t usb_adc_mic_next_test_sample(void)
{
    uint32_t index;
    int16_t sample;

    index = s_test_tone_phase >> USB_ADC_MIC_TEST_TONE_PHASE_SHIFT;
    sample = sine_32pt[index & (USB_ADC_MIC_TEST_TONE_TABLE_SIZE - 1U)];
    s_test_tone_phase += USB_ADC_MIC_TEST_TONE_PHASE_STEP;

    return sample;
}

static void usb_adc_mic_fill_test_tone(uint8_t *buffer)
{
    uint8_t *p = buffer;

    for (uint32_t i = 0; i < USB_ADC_MIC_SAMPLES_PER_MS; i++)
    {
        int16_t sample = usb_adc_mic_next_test_sample();

        for (uint32_t ch = 0; ch < USB_ADC_MIC_CHANNELS; ch++)
        {
            *p++ = (uint8_t)(sample & 0xff);
            *p++ = (uint8_t)(((uint16_t)sample >> 8) & 0xff);
        }
    }
}
#endif

static void usb_adc_mic_try_send(uint8_t busid)
{
    int ret;

    if (!s_streaming)
    {
        return;
    }
    if (s_ep_tx_busy)
    {
        return;
    }

#if USB_ADC_MIC_USE_TEST_TONE
    usb_adc_mic_fill_test_tone(s_usb_tx_buffer);
#else
    if (!usb_adc_mic_ring_pop(s_usb_tx_buffer))
    {
        memset(s_usb_tx_buffer, 0, sizeof(s_usb_tx_buffer));
        s_usb_underruns++;
    }
#endif

    s_ep_tx_busy = true;
    ret = usbd_ep_start_write(busid, AUDIO_IN_EP, s_usb_tx_buffer, sizeof(s_usb_tx_buffer));
    if (ret < 0)
    {
        s_ep_tx_busy = false;
#if USB_ADC_MIC_USE_TEST_TONE
        /* Roll the phase back: fill_test_tone() above already consumed one
         * packet's worth of samples, but nothing actually went out. Without
         * this each failed submit drops 16 samples and the tone drifts.
         * uint32_t wraparound is fine - the DDS only uses phase mod 2^32. */
        s_test_tone_phase -= USB_ADC_MIC_SAMPLES_PER_MS * USB_ADC_MIC_TEST_TONE_PHASE_STEP;
#endif
    }
}

static void usbd_event_handler(uint8_t busid, uint8_t event)
{
    (void)busid;

    switch (event)
    {
    case USBD_EVENT_RESET:
    case USBD_EVENT_DISCONNECTED:
    case USBD_EVENT_SUSPEND:
        usb_adc_mic_stop_stream();
        break;
    default:
        break;
    }
}

void usbd_audio_open(uint8_t busid, uint8_t intf)
{
    if (intf != 1U)
    {
        return;
    }

    if (usb_adc_mic_start_stream())
    {
        USB_LOG_RAW("ADC MIC OPEN\r\n");
        /* PORTSC1's PSPD is only set by the HS chirp, which has certainly
         * happened by the time the host sends SET_INTERFACE - printing it at
         * component-init time just reports the reset value 0x00, which this
         * port maps to full speed. USB_SPEED_LOW=1, FULL=2, HIGH=3 (usb_def.h).
         * Expect 3: a 2 (full speed) would make EP_INTERVAL 0x03 mean 3 ms of
         * interval for 1 ms of audio. */
        USB_LOG_RAW("ADC MIC port speed: %u\r\n", (unsigned)usbd_get_port_speed(busid));
        usb_adc_mic_kick_tx();
    }
    else
    {
        /* Silence with no "ADC MIC OPEN" line means the host never issued
         * SetInterface(1,1) and this function was never reached. */
        USB_LOG_ERR("ADC MIC OPEN failed: stream start failed\r\n");
    }
}

void usbd_audio_close(uint8_t busid, uint8_t intf)
{
    (void)busid;

    if (intf != 1U)
    {
        return;
    }

    USB_LOG_RAW("ADC MIC CLOSE\r\n");
    usb_adc_mic_stop_stream();
}

void usbd_audio_set_sampling_freq(uint8_t busid, uint8_t ep, uint32_t sampling_freq)
{
    (void)busid;

    if (ep == AUDIO_IN_EP)
    {
        if (sampling_freq != USB_ADC_MIC_SAMPLE_RATE)
        {
            USB_LOG_ERR("ADC MIC only supports %u Hz\r\n", USB_ADC_MIC_SAMPLE_RATE);
        }
        s_mic_sample_rate = USB_ADC_MIC_SAMPLE_RATE;
    }
}

uint32_t usbd_audio_get_sampling_freq(uint8_t busid, uint8_t ep)
{
    (void)busid;

    if (ep == AUDIO_IN_EP)
    {
        return s_mic_sample_rate;
    }

    return 0U;
}

void usbd_audio_get_sampling_freq_table(uint8_t busid, uint8_t ep, uint8_t **sampling_freq_table)
{
    (void)busid;

    if (ep == AUDIO_IN_EP)
    {
        *sampling_freq_table = (uint8_t *)mic_default_sampling_freq_table;
    }
}

void usbd_audio_set_volume(uint8_t busid, uint8_t ep, uint8_t ch, int volume_db)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        s_usb_volume_db[ch] = volume_db;
    }
}

int usbd_audio_get_volume(uint8_t busid, uint8_t ep, uint8_t ch)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        return s_usb_volume_db[ch];
    }

    return 0;
}

void usbd_audio_set_mute(uint8_t busid, uint8_t ep, uint8_t ch, bool mute)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        s_usb_mute_state[ch] = mute;
    }
}

bool usbd_audio_get_mute(uint8_t busid, uint8_t ep, uint8_t ch)
{
    (void)busid;

    if ((ep == AUDIO_IN_EP) && (ch <= USB_ADC_MIC_CHANNELS))
    {
        return s_usb_mute_state[ch];
    }

    return false;
}

void usbd_audio_iso_in_callback(uint8_t busid, uint8_t ep, uint32_t nbytes)
{
    (void)busid;
    (void)nbytes;

    if (ep != AUDIO_IN_EP)
    {
        return;
    }

    s_ep_tx_busy = false;
    usb_adc_mic_kick_tx();
}

static struct usbd_endpoint audio_in_ep =
{
    .ep_cb = usbd_audio_iso_in_callback,
    .ep_addr = AUDIO_IN_EP
};

static struct usbd_interface intf0;
static struct usbd_interface intf1;

static struct audio_entity_info audio_entity_table[] =
{
    {
        .bEntityId = AUDIO_IN_CLOCK_ID,
        .bDescriptorSubtype = AUDIO_CONTROL_CLOCK_SOURCE,
        .ep = AUDIO_IN_EP
    },
    {
        .bEntityId = AUDIO_IN_FU_ID,
        .bDescriptorSubtype = AUDIO_CONTROL_FEATURE_UNIT,
        .ep = AUDIO_IN_EP
    },
};

void usb_adc_mic_init(uint8_t busid, uintptr_t reg_base)
{
    s_mic_sample_rate = USB_ADC_MIC_SAMPLE_RATE;

    usb_adc_mic_hw_init();
    (void)usb_adc_mic_tx_worker_init(busid);

    usbd_desc_register(busid, &audio_v2_descriptor);
    usbd_add_interface(busid, usbd_audio_init_intf(busid, &intf0, 0x0200, audio_entity_table, 2));
    usbd_add_interface(busid, usbd_audio_init_intf(busid, &intf1, 0x0200, audio_entity_table, 2));
    usbd_add_endpoint(busid, &audio_in_ep);
    usbd_initialize(busid, reg_base, usbd_event_handler);
}

#endif
